# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
first = pd.Series(np.random.randint(1, 5, 100))
second = pd.Series(np.random.randint(1, 4, 100))
third = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([first, second, third], axis=1)
df.head()

   0  1      2
0  2  3  17612
1  2  1  10744
2  1  3  22761
3  2  3  19025
4  3  1  26094

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [10]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   bedrs            100 non-null    int64
 1   bathrs           100 non-null    int64
 2   price_sqr_meter  100 non-null    int64
dtypes: int64(3)
memory usage: 2.5 KB

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
big_df = pd.concat([first, second, third], axis=0)
bigcolumn = big_df.to_frame()
bigcolumn.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300 entries, 0 to 99
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       300 non-null    int64
dtypes: int64(1)
memory usage: 4.7 KB

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [16]:
bigcolumn

        0
0       2
1       2
2       1
3       2
4       3
..    ...
95  17275
96  22332
97  15296
98  14197
99  23644

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        1
3        2
4        3
..     ...
295  17275
296  22332
297  15296
298  14197
299  23644

[300 rows x 1 columns]